# 主要都市名と北緯東経情報を連想配列に格納し表示

# 連想配列を作成（北緯東経情報はタプルで保持）
pref_dict = {"東京都" : (35.6896342,139.6899121),
             "横浜市" : (35.4440992,139.6358831),
             "札幌市" : (43.0620803,141.3521727),
             "大阪市" : (34.6937381,135.4999759),
             "神戸市" : (34.6894859,135.1935503),
             "京都市" : (35.0116574,135.7659363),
             "金沢市" : (36.5610485,136.6543849)}

print("主要都市情報")
# 連想配列の全要素の表示
for key,value in pref_dict.items():
    print(key, "の位置：(北緯 ", value[0], ", 東経 ", value[1], ")", sep="")
