'''
10 件の整数値を入力し、偶数値の要素の配列と奇数値の要素の配列を作成して、それぞれ画面に表示するプロ
グラムを作成しなさい。 
【実行例】 
1 件目：整数を入力 = 10 
2 件目：整数を入力 = 20 
3 件目：整数を入力 = -3 
4 件目：整数を入力 = 15 
5 件目：整数を入力 = 22 
6 件目：整数を入力 = -8 
7 件目：整数を入力 = 33 
8 件目：整数を入力 = 58 
9 件目：整数を入力 = -9 
10 件目：整数を入力 = 18 
偶数値配列 =  [10, 20, 22, -8, 58, 18] 
奇数値配列 =  [-3, 15, 33, -9]
'''
a = []
b = []

for i in range(1, 11):
    num = int(input(f"{i} 件目：整数を入力"))
    if num % 2 == 0:
        a.append(num)
    else:
        b.append(num)
print(f"偶数値配列 =  {a}")
print(f"奇数値配列 =  {b}")




