'''
1 から4までの整数の乱数を発生させ、その乱数を返す関数(メソッド)を定義しなさい。その関数(メソッド)
を利用して、今日の運勢を下記の実行例のように画面に表示するプログラムを作成しなさい。乱数が1のとき絶
好調、2のとき好調、3のとき不調、4のとき絶不調と表示します。 
【実行例】 
本日の運勢：好調
'''

###### 関数 ########
# 関数名：fortune
# 処理内容：1 から4までの整数の乱数を発生させ、その乱数を返す
# 条件　⇒　乱数が1のとき絶好調、2のとき好調、3のとき不調、4のとき絶不調と表示
# 引数：fortune
# 戻り値：


import random
def fortune_num():
    return random.randint (1, 4)
####### メイン ######
fortune = fortune_num()
if fortune == 1:
    print("絶好調")
elif fortune == 2:
    print("好調")
elif fortune == 3:
    print("不調")
elif fortune == 4:
    print("絶不調")
