'''
3 人分の名前と得点のデータを連想配列の引数として受け取り、各人の合否と平均点を下記の実行例のように
画面に表示する関数(メソッド)を定義しなさい。合格点は60点以上、平均点は小数第3位を切り捨てとします。
その関数(メソッド)を利用して、ユーザが入力した3人分の合否判定と平均点の算出をして画面に表示をするプ
ログラムを作成しなさい。 
【実行例】 
1 人目の名前を入力して下さい：A 
1 人目の点数を入力して下さい：77 
2 人目の名前を入力して下さい：B 
2 人目の点数を入力して下さい：58 
3 人目の名前を入力して下さい：C 
3 人目の点数を入力して下さい：92 
A さんは合格です。 
B さんは不合格です。 
C さんは合格です。 
平均点は、75.66点です。
'''
####### 関数 ########
# 関数名：three_stu_point
# 処理内容：3 人分の名前と得点のデータを連想配列の引数として受け取り
#          各人の合否と平均点を画面に表示する
#        ※関数を利用して合格点は60点以上、平均点は小数第3位を切り捨てとします
# 　　　　　3人分の合否判定と平均点の算出する
# 引数：
# 戻り値：
# def three_stu_point():
    


###### メイン ######
