



lev0_words_kanji = [
    "もも", "パパ", "熊", "愛", "赤", "アジ", "穴", "鮎", "イカ", "石",
    "犬", "牛", "嘘", "ウニ", "梅", "エイ", "サバ", "海老", "笑み", "カニ",
    "ワニ", "ゴム", "サル", "寿司", "タコ", "タマ", "チゲ", "ポチ", "ミケ", "ブリ",
    "ピザ", "夏", "春", "秋", "冬", "時価", "猫", "井戸", "月", "竹",
    "砂", "海", "貝", "ネギ", "地下", "風", "城", "壁", "象", "ノリ",
    "イス", "皿", "花", "馬", "パン", "米", "ガム", "ドア", "糸", "雪"
]

################################## 関数
class typing:
    def __init__(self,word_manager, timer, level):
        self.word_manager = word_manager
        self.timer = timer
        self.level = level


    def word(self):
        selct_level = self.level
        lev0_words_hiragana = [
        "もも", "ぱぱ", "くま", "あい", "あか", "あじ", "あな", "あゆ", "いか", "いし",
        "いぬ", "うし", "うそ", "うに", "うめ", "えい", "さば", "えび", "えみ", "かに",
        "わに", "ごむ", "さる", "すし", "たこ", "たま", "ちげ", "ぽち", "みけ", "ぶり",
        "ぴざ", "なつ", "はる", "あき", "ふゆ", "じか", "ねこ", "いど", "つき", "たけ",
        "すな", "うみ", "かい", "ねぎ", "ちか", "かぜ", "しろ", "かべ", "ぞう", "のり",
        "いす", "さら", "はな", "うま", "ぱん", "こめ", "がむ", "どあ", "いと", "ゆき"
        ]
        lev0_words_kanji = [
        "もも", "パパ", "熊", "愛", "赤", "アジ", "穴", "鮎", "イカ", "石",
        "犬", "牛", "嘘", "ウニ", "梅", "エイ", "サバ", "海老", "笑み", "カニ",
        "ワニ", "ゴム", "サル", "寿司", "タコ", "タマ", "チゲ", "ポチ", "ミケ", "ブリ",
        "ピザ", "夏", "春", "秋", "冬", "時価", "猫", "井戸", "月", "竹",
        "砂", "海", "貝", "ネギ", "地下", "風", "城", "壁", "象", "ノリ",
        "イス", "皿", "花", "馬", "パン", "米", "ガム", "ドア", "糸", "雪"
        ]


################################## メイン
print('タイピングゲームを起動します')
# レベルを聞く
while True:
    try: 
        setting_level = int(input('レベルを選択してください(０～１２まで)'))
        break
    except ValueError:
        print('整数を入力してください')
while True:
    if setting_level < 13:
        break
    else:
        while True:
            try: 
                setting_level = int(input('適切なレベルを選択してください>>>'))
                break
            except ValueError:
                print('整数を入力してください')




setting_level += 1
print(setting_level)

# setting_level = int(input('レべルを決めてください\n１から１３まで>>>'))
