from time import sleep
import time
import random

##### 文字の色づけ : 参考　https://www.python.ambitious-engineer.com/archives/3721
end = '\033[0m' # リセット
# 色セット
red = '\033[31m'
green = '\033[32m'
yellow = '\033[33m'
blue = '\033[34m'
magenda = '\033[35m'
cyan = '\033[36m'
# その他
reverse_coler = '\033[7m' # 色反転
bold = '\033[1m' # 太字
underline =  '\033[4m' # アンダーライン

############################################## 関数

class tiping:
    issue_level = 0
    result = 0

    def __init__(self, lev):
        self.lev = lev

    def word_lev_(self):
        if self == 0:
            # レベル0の単語
            lev0 = [lev0_words_kanji, lev0_words_hiragana]
            lev0_words_hiragana = [
                "もも", "ぱぱ", "くま", "あい", "あか", "あじ", "あな", "あゆ", "いか", "いし",
                "いぬ", "うし", "うそ", "うに", "うめ", "えい", "さば", "えび", "えみ", "かに",
                "わに", "ごむ", "さる", "すし", "たこ", "たま", "ちげ", "ぽち", "みけ", "ぶり",
                "ぴざ", "なつ", "はる", "あき", "ふゆ", "じか", "ねこ", "いど", "つき", "たけ",
                "すな", "うみ", "かい", "ねぎ", "ちか", "かぜ", "しろ", "かべ", "ぞう", "のり",
                "いす", "さら", "はな", "うま", "ぱん", "こめ", "がむ", "どあ", "いと", "ゆき"
                ]
            lev0_words_kanji = [
                "もも", "パパ", "熊", "愛", "赤", "アジ", "穴", "鮎", "イカ", "石",
                "犬", "牛", "嘘", "ウニ", "梅", "エイ", "サバ", "海老", "笑み", "カニ",
                "ワニ", "ゴム", "サル", "寿司", "タコ", "タマ", "チゲ", "ポチ", "ミケ", "ブリ",
                "ピザ", "夏", "春", "秋", "冬", "時価", "猫", "井戸", "月", "竹",
                "砂", "海", "貝", "ネギ", "地下", "風", "城", "壁", "象", "ノリ",
                "イス", "皿", "花", "馬", "パン", "米", "ガム", "ドア", "糸", "雪"
                ]
            question_hiragana = lev0_words_hiragana[random.randint(0, 60)]
            question_kanji = lev0_words_kanji[random.randint(0, 60)]
            self.lev = [question_hiragana, question_kanji]
            print(self.lev)

        elif self == 1:
            # レベル１の単語
            lev1 = [lev1_words_kanji, lev1_words_hiragana]
            lev1_words_hiragana = [
                "やけい", "らいち", "しげん", "もでる", "こいん", "あふろ", "かんじ", "ばなな", "ばっと", "あなご",
                "うなぎ", "わーい", "すいか", "いちご", "くろず", "つつじ", "ぞんび", "ごうう", "かーぶ", "あかみ",
                "あわび", "いくら", "いわし", "おちゃ", "かえる", "かれい", "あれ？", "けがに", "さっき", "さんま",
                "はまち", "しろみ", "かっぱ", "にゃー", "ばった", "ひらめ", "ほたて", "まうす", "まぐろ", "するめ",
                "さんそ", "ぷりん", "わさび", "かっぱ", "まっち", "あー！", "わー！", "とんぼ", "でんわ", "すずめ",
                "れたす", "ばけつ", "ぼーる", "めがね", "ことり", "ひっし", "なまず", "あさり", "しじみ", "むしば",
                "しっぽ", "ばっと", "ぼきん", "うさぎ", "あひる", "ひつじ", "つくえ", "あいす", "はなび", "おやつ",
                "みるく", "こっぷ", "おふろ", "さくら", "わごむ", "めいし", "のーと", "くるま", "きっく", "すきー",
                "しまい", "りぼん", "ずぼん", "ぶーつ", "りんご", "こあら", "れんず", "だいや", "するめ", "かれー",
                "めろん", "めだか", "ねごと"
            ]

            lev1_words_kanji = [

                "夜景", "ライチ", "資源", "モデル", "コイン", "アフロ", "漢字", "バナナ", "バット", "アナゴ",
                "ウナギ", "わーい", "スイカ", "イチゴ", "黒酢", "つつじ", "ゾンビ", "豪雨", "カーブ", "赤身",
                "アワビ", "イクラ", "イワシ", "お茶", "カエル", "カレイ", "あれ？", "毛ガニ", "殺気", "サンマ",
                "ハマチ", "白身", "カッパ", "ニャー", "バッタ", "ヒラメ", "ホタテ", "マウス", "マグロ", "スルメ",
                "酸素", "プリン", "ワサビ", "カッパ", "マッチ", "あー！", "わー！", "トンボ", "電話", "スズメ",
                "レタス", "バケツ", "ボール", "眼鏡", "小鳥", "必死", "ナマズ", "アサリ", "シジミ", "虫歯",
                "尻尾", "バット", "募金", "ウサギ", "アヒル", "ヒツジ", "机", "アイス", "花火", "おやつ",
                "ミルク", "コップ", "お風呂", "桜", "輪ゴム", "名刺", "ノート", "車", "キック", "スキー",
                "姉妹", "リボン", "ズボン", "ブーツ", "りんご", "コアラ", "レンズ", "ダイヤ", "するめ", "カレー",
                "メロン", "メダカ", "寝言"
            ]
            question_hiragana = lev1_words_hiragana[random.randint(0, 93)]
            question_kanji = lev1_words_kanji[random.randint(0, 93)]
            self= [question_hiragana, question_kanji]
            return question

        elif self == 2:
            # レベル2の単語
            lev2 = [lev2_words_kanji, lev2_words_hiragana]
            lev2_words_hiragana = [
                "ふいうち", "くまげら", "むささび", "すぺいん", "ちちのひ", "さざなみ", "しょどう", "たちよみ", "びしょう", "おかりな",
                "ふじさん", "しきしゃ", "ぱぱいや", "どりあん", "こーひー", "ししゃも", "たこやき", "とびっこ", "やきゅう", "おむれつ",
                "ぐろーぶ", "にんじゃ", "きばせん", "わたがし", "らーめん", "よーよー", "かおもじ", "こしあん", "つぶあん", "たいふう",
                "そぷらの", "いのしし", "ふぃるむ", "ぶらんど", "あぼかど", "おれんじ", "めんせき", "たんぽぽ", "うめしゅ", "たぴおか",
                "かんふー", "てぬぐい", "あいこん", "しまうま", "らいおん", "ろうそく", "くつした", "きんぱつ", "けんだま", "かにたま",
                "ぼくとう", "せんしゃ", "あかがい", "あまえび", "うぐいす", "いやーん", "えんがわ", "おおとろ", "かずのこ", "さーもん",
                "すーぱー", "すらいむ", "でこぴん", "あざらし", "ねぎとろ", "はんせい", "きんぎょ", "ざりがに", "みじんこ", "しんばし",
                "はちみつ", "かんぱち", "しょうゆ", "すきやき", "すずむし", "きゃー！", "なまはむ", "ちゃいむ", "さーかす", "きゃべつ",
                "そうじき", "あおぞら", "おにぎり", "ふうりん", "ぼーなす", "ちきゅう", "きゃんぷ", "はくしゅ", "だいこん", "しんかい",
                "がっこう", "ふぁいる", "くりっく", "ちょきん", "にわとり", "ごーる！", "おまつり", "しゃべる", "すこっぷ", "はつゆめ",
                "くっきー", "こーひー", "こうちゃ", "せんとう", "おはなみ", "けしごむ", "べてらん", "かまくら", "たいまー", "ばんぱー",
                "ながぐつ", "さっかー", "すけーと", "ばってら", "ぎちょう", "ねくたい", "かぼちゃ", "こくばん", "わるぢえ", "かんけり"
            ]

            lev2_words_kanji = [
                "不意打ち", "クマゲラ", "ムササビ", "スペイン", "父の日", "さざなみ", "書道", "立ち読み", "微笑", "オカリナ",
                "富士山", "指揮者", "パパイヤ", "ドリアン", "コーヒー", "ししゃも", "たこ焼き", "トビッコ", "野球", "オムレツ",
                "グローブ", "忍者", "騎馬戦", "綿菓子", "ラーメン", "ヨーヨー", "顔文字", "こしあん", "つぶあん", "台風",
                "ソプラノ", "イノシシ", "フィルム", "ブランド", "アボカド", "オレンジ", "面積", "たんぽぽ", "梅酒", "タピオカ",
                "カンフー", "てぬぐい", "アイコン", "シマウマ", "ライオン", "ろうそく", "靴下", "金髪", "けんだま", "かに玉",
                "木刀", "洗車", "赤貝", "甘エビ", "ウグイス", "イヤーン", "えんがわ", "大トロ", "数の子", "サーモン",
                "スーパー", "スライム", "でこピン", "アザラシ", "ネギとろ", "反省", "金魚", "ザリガニ", "ミジンコ", "新橋",
                "蜂蜜", "カンパチ", "醤油", "スキヤキ", "鈴虫", "キャー！", "生ハム", "チャイム", "サーカス", "キャベツ",
                "掃除機", "青空", "おにぎり", "風鈴", "ボーナス", "地球", "キャンプ", "拍手", "大根", "深海",
                "学校", "ファイル", "クリック", "貯金", "ニワトリ", "ゴール！", "お祭り", "シャベル", "スコップ", "初夢",
                "クッキー", "コーヒー", "紅茶", "銭湯", "お花見", "消しゴム", "べテラン", "かまくら", "タイマー", "バンパー",
                "長靴", "サッカー", "スケート", "バッテラ", "議長", "ネクタイ", "かぼちゃ", "黒板", "悪知恵", "缶蹴り"
            ]
            question_hiragana = lev2_words_hiragana[random.randint(0, 120)]
            question_kanji = lev2_words_kanji[random.randint(0, 120)]
            self= [question_hiragana, question_kanji]
            return question

        elif self == 3:
            # レベル３
            lev3 = [lev3_words_kanji, lev3_words_hiragana]
            lev3_words_hiragana = [
                "ひめりんご", "たまのこし", "おんらいん", "にほんちず", "ちんじゅう", "もらいなき", "ほうせんか", "すいさいが", "かせいじん", "りこーだー",
                "ばいおりん", "はーもにか", "すとらっぷ", "そりてぃあ", "もんぶらん", "かつかれー", "こどものひ", "らっきー！", "めんちかつ", "おむらいす",
                "えいたんご", "あくせんと", "いいゆだな", "さくらんぼ", "にわかあめ", "らんきんぐ", "ちゃーはん", "くりすます", "ちょうちょ", "まよねーず",
                "はなふぶき", "しくらめん", "うでどけい", "だいどころ", "りこーだー", "りんごあめ", "かれんだー", "ほいっする", "さふぁいあ", "かみねんど",
                "だいとかい", "でりけーと", "すなどけい", "すとらいぷ", "ふぃるたー", "おままごと", "はりけーん", "ゆきだるま", "すにーかー", "とらくたー",
                "いやしけい", "おきにいり", "ちへいせん", "くれーたー", "ぎゃらりー", "らんどせる", "ひかえしつ", "てでぃべあ", "ゆめごこち", "しんちょう",
                "たいじゅう", "あんけーと", "くりすたる", "かんがるー", "しゅりけん", "ひざこぞう", "すとれーと", "ろんぐぱす", "ひょうがき", "えどばくふ",
                "ふるほんや", "らふれしあ", "ひなあられ", "あめふらし", "あめちゃん", "あらいやだ", "いいてんき", "いたいです", "えびふらい", "おおもりで",
                "かうんたー", "ぎんしゃり", "しゃったー", "しんぶんし", "ずわいがに", "たらばがに", "ちゅうとろ", "あめとむち", "たまごやき", "めだまやき",
                "ぶるどっぐ", "ぼたんえび", "ほんきのめ", "もやしっこ", "よっぱらい", "わたぼこり", "ちらしずし", "てまきずし", "りさいくる", "てっかまき",
                "おふさいど", "とくもりで", "するめいか", "こどものひ", "えころじー", "えちけっと", "てぃらみす", "でざいなー", "はねぼうき", "かれんだー",
                "きーぼーど", "さくらさく", "かたたたき", "ねったいや", "かっぱまき", "おやこどん", "びりやーど", "ぼうりんぐ", "じせだいき", "たいぴんぐ",
                "まんほーる", "ゆうえんち", "どらいやー", "わいしゃつ", "おおそうじ", "おーとばい", "こうきあつ", "じゃんぐる", "しゃんぱん", "えいがかん",
                "こんさーと", "ごぜんさま", "もしもし？", "むじんとう", "ごーじゃす", "こんにちは", "さようなら", "だいにんき", "はつひので", "すぴーかー",
                "てぃっしゅ", "えどじだい", "ちょんまげ", "こいのぼり", "そーせーじ", "きょうだい", "ゆきだるま", "たっきゅう", "かたるしす", "さくらもち",
                "よーぐると", "しょうかき", "ぷろのわざ", "ぶゆうでん", "あるまじろ", "てれびっこ", "はろうぃん", "ぱんぷきん", "じがじさん", "ぺあるっく"
            ]

            lev3_words_kanji = [
                "姫りんご", "玉の輿", "オンライン", "日本地図", "珍獣", "もらい泣き", "ホウセンカ", "水彩画", "火星人", "リコーダー",
                "バイオリン", "ハーモニカ", "ストラップ", "ソリティア", "モンブラン", "カツカレー", "こどもの日", "ラッキー！", "メンチカツ", "オムライス",
                "英単語", "アクセント", "いい湯だな", "さくらんぼ", "にわか雨", "ランキング", "チャーハン", "クリスマス", "ちょうちょ", "マヨネーズ",
                "花吹雪", "シクラメン", "腕時計", "台所", "リコーダー", "りんご飴", "カレンダー", "ホイッスル", "サファイア", "紙粘土",
                "大都会", "デリケート", "砂時計", "ストライプ", "フィルター", "おままごと", "ハリケーン", "雪だるま", "スニーカー", "トラクター",
                "癒し系", "お気に入り", "地平線", "クレーター", "ギャラリー", "ランドセル", "控え室", "テディベア", "夢心地", "身長",
                "体重", "アンケート", "クリスタル", "カンガルー", "手裏剣", "ひざ小僧", "ストレート", "ロングパス", "氷河期", "江戸幕府",
                "古本屋", "ラフレシア", "ひなあられ", "アメフラシ", "飴ちゃん", "アラ嫌だ", "いい天気", "痛いです", "エビフライ", "大盛りで",
                "カウンター", "銀シャリ", "シャッター", "新聞紙", "ズワイガニ", "タラバガニ", "中トロ", "アメとムチ", "玉子焼き", "目玉焼き",
                "ブルドッグ", "ボタン海老", "本気の目", "モヤシっ子", "酔っ払い", "綿ボコリ", "ちらしズシ", "手巻きズシ", "リサイクル", "鉄火巻き",
                "オフサイド", "特盛りで", "スルメイカ", "こどもの日", "エコロジー", "エチケット", "ティラミス", "デザイナー", "羽根ボウキ", "カレンダー",
                "キーボード", "サクラサク", "肩叩き", "熱帯夜", "カッパ巻き", "親子丼", "ビリヤード", "ボウリング", "次世代機", "タイピング",
                "マンホール", "遊園地", "ドライヤー", "ワイシャツ", "大掃除", "オートバイ", "高気圧", "ジャングル", "シャンパン", "映画館",
                "コンサート", "午前様", "もしもし？", "無人島", "ゴージャス", "こんにちは", "さようなら", "大人気", "初日の出", "スピーカー",
                "ティッシュ", "江戸時代", "ちょんまげ", "鯉のぼり", "ソーセージ", "兄弟", "雪だるま", "卓球", "カタルシス", "さくらもち",
                "ヨーグルト", "消火器", "プロの技", "武勇伝", "アルマジロ", "テレビっ子", "ハロウィン", "パンプキン", "自画自賛", "ペアルック"
            ]
            question_hiragana = lev3_words_hiragana[random.randint(0, 150)]
            question_kanji = lev3_words_kanji[random.randint(0, 150)]
            self= [question_hiragana, question_kanji]
            return question

        elif self == 4:
            # レベル４
            lev4 = [lev4_words_kanji, lev4_words_hiragana]
            lev4_words_hiragana = [
                "まよえるこひつじ", "さんちちょくそう", "ぜんせききんえん", "きしょうてんけつ", "ごうこんしようよ", "とうようのまじょ", "びじょとやじゅう", "きょうだいげんか", "しんたいそくてい", "ひゃくまんぼると",
                "あせろらかじゅう", "おれじゃないって", "りょうさいけんぼ", "にんじんはきらい", "ちゃぶだいがえし", "わーぷろけんてい", "いちげきひっさつ", "てんごくとじごく", "ぼでぃらんげーじ", "どらごんふるーつ",
                "しんれいすぽっと", "わすれものない？", "かるしうむぶそく", "うーぱーるーぱー", "ことりのさえずり", "ぼっしゅうします", "げんきいっぱい！", "おはだにやさしい", "いけばながしゅみ", "しんぴんのつくえ",
                "でみぐらすそーす", "どうぶつのふしぎ", "あたたかいひざし", "でんげきけっこん", "おもしろはんぶん", "いがいないちめん", "わかてのるーきー", "けんとうをいのる", "ひっこしびんぼう", "がんばれにっぽん",
                "ぴんぽんだっしゅ", "ゆびきりげんまん", "ししゃものたまご", "からしめんたいこ", "はっしゅどびーふ", "ぶらっくこーひー", "せいけんこうたい", "ここだけのはなし", "きんしゅきんえん", "いまがちゃんす！",
                "ぜんげんてっかい", "わたしはめがねは", "おりかえしちてん", "ぼうさいくんれん", "ほしのおうじさま", "ふんだりけったり", "ときすでにおそし", "あるひのできごと", "ちゃーしゅーめん", "しゃちょうひしょ",
                "にゅーすそくほう", "ぼんごれびあんこ", "えいぷりるふーる", "やきとうもろこし", "かくやすぶっけん", "てれびのりもこん", "あいさいべんとう", "ぶらっくぺっぱー", "さくらまうきせつ", "だいれくとめーる",
                "くうきがおいしい", "さんかくじょうぎ", "きしょうよほうし", "いっせきにちょう", "こーんぽたーじゅ", "もぎたてふるーつ", "かいぎしつのかぎ", "とうきょうちさい", "ねっけつきょうし", "ぐれーぷふるーつ",
                "さくらのはなびら", "ちゅうかんてすと", "とうめいにんげん", "あんごうかいどく", "にほんだいひょう", "しふくのひととき", "りくるーとすーつ", "こうかせいしょう", "しょうきんかせぎ", "いいおあじですね",
                "じゅくれんのわざ", "ちゅうしゃじょう", "しゃしんさつえい", "だちょうのたまご", "ぜんこくたいかい", "さんきんこうたい", "ひっとえんどらん", "げんだいしゃかい", "きしょうえいせい", "べーすらんにんぐ",
                "やきゅうひとすじ", "てんたいかんそく", "せいようたんぽぽ", "ひっしょうきがん", "うちゅうせいふく", "うちゅうゆうえい", "せいとかいちょう", "いたくしないでね", "いちえんひろった", "うそでもいいから",
                "えびでたいをつる", "おおさじいっぱい", "おさきにしつれい", "ことぶきたいしゃ", "このきなんのき？", "しんれいしゃしん", "すなっぷきかせて", "ちょっとまった！", "つぎはにほんしゅ", "でぱーとでまいご",
                "でんきゅうきれた", "ねぼうでけびょう", "ばすがすばくはつ", "ぴらみっどぱわー", "ぷりんあらもーど", "もってけどろぼー", "もよりえきはちば", "らくらいちゅうい", "たましいのさけび", "いちえんたりない",
                "たっちたいぴんぐ", "みすてりーつあー", "けいりょうかっぷ", "おしょうゆとって", "こうぎょうちたい", "しんこんりょこう", "ねっとさーふぃん", "こんびにべんとう", "ちんしてたべてね", "いっぴきおおかみ",
                "きっくぼくしんぐ", "こんちゅうずかん", "げんちちょうたつ", "きせつのでざーと", "ふりーまーけっと", "しんかいのしんぴ", "しゃーぷぺんしる", "びんぼうひまなし", "たなからぼたもち", "しょちゅうみまい",
                "あふれでるちせい", "こいんらんどりー", "ばーすでーけーき", "めりーくりすます", "ひかりふぁいばー", "しろながすくじら", "しゅのーけりんぐ", "すかいだいびんぐ", "けんさくえんじん", "しみゅれーしょん",
                "ほーむぽじしょん", "ゆうじゅうふだん", "じんたいのしくみ", "こーひーぶれいく", "ごうかきゃくせん", "つうきんかいそく", "あんぜんだいいち", "もうけんちゅうい", "いわしのかんづめ", "ばんじーじゃんぷ",
                "すとっぷうぉっち", "かいちゅうどけい", "せいいをみせます", "じぇっとふんしゃ", "はわいあんぶるー", "ふざいちゃくしん", "ちゅうしゃこわい", "えんげるけいすう", "じんせいいろいろ", "ろんよりしょうこ",
                "あんたにほれた！", "したかんじゃった", "けーきはべつばら", "ぜったいおんかん", "きんだんのかじつ", "ありばいこうさく", "こうえんでびゅー", "きょうのうらない", "てもあしもでない", "ほいっぷくりーむ",
                "ぜっせいのびじょ", "あなあきくつした"
            ]

            lev4_words_kanji = [
                "迷える子羊", "産地直送", "全席禁煙", "起承転結", "合コンしようよ", "東洋の魔女", "美女と野獣", "兄弟げんか", "身体測定", "百万ボルト",
                "アセロラ果汁", "俺じゃないって", "良妻賢母", "ニンジンは嫌い", "ちゃぶ台返し", "ワープロ検定", "一撃必殺", "天国と地獄", "ボディランゲージ", "ドラゴンフルーツ",
                "心霊スポット", "忘れ物ない？", "カルシウム不足", "ウーパールーパー", "小鳥のさえずり", "没収します", "元気いっぱい！", "お肌に優しい", "生け花が趣味", "新品の机",
                "デミグラスソース", "動物の不思議", "あたたかい日差し", "電撃結婚", "面白半分", "意外な一面", "若手のルーキー", "健闘を祈る", "引越し貧乏", "頑張れニッポン",
                "ピンポンダッシュ", "ゆびきりげんまん", "ししゃもの卵", "からし明太子", "ハッシュドビーフ", "ブラックコーヒー", "政権交代", "ここだけの話", "禁酒禁煙", "今がチャンス！",
                "前言撤回", "私はメガネ派", "折り返し地点", "防災訓練", "星の王子様", "踏んだり蹴ったり", "時すでに遅し", "ある日の出来事", "チャーシューメン", "社長秘書",
                "ニュース速報", "ボンゴレビアンコ", "エイプリルフール", "焼きとうもろこし", "格安物件", "テレビのリモコン", "愛妻弁当", "ブラックペッパー", "桜舞う季節", "ダイレクトメール",
                "空気がおいしい", "三角定規", "気象予報士", "一石二鳥", "コーンポタージュ", "もぎたてフルーツ", "会議室の鍵", "東京地裁", "熱血教師", "グレープフルーツ",
                "桜の花びら", "中間テスト", "透明人間", "暗号解読", "日本代表", "至福のひととき", "リクルートスーツ", "校歌斉唱", "賞金稼ぎ", "いいお味ですね",
                "熟練の技", "駐車場", "写真撮影", "ダチョウの卵", "全国大会", "参勤交代", "ヒットエンドラン", "現代社会", "気象衛星", "ベースランニング",
                "野球一筋", "天体観測", "西洋タンポポ", "必勝祈願", "宇宙征服", "宇宙遊泳", "生徒会長", "痛くしないでね", "一円拾った", "嘘でもいいから",
                "エビでタイを釣る", "大さじ一杯", "お先に失礼", "寿退社", "この木何の木？", "心霊写真", "スナップ効かせて", "ちょっと待った！", "次は日本酒", "デパートで迷子",
                "電球切れた", "寝坊で仮病", "バスガス爆発", "ピラミッドパワー", "プリンアラモード", "持ってけドロボー", "最寄駅は千葉", "落雷注意", "魂の叫び", "一円足りない",
                "タッチタイピング", "ミステリーツアー", "計量カップ", "お醤油とって", "工業地帯", "新婚旅行", "ネットサーフィン", "コンビニ弁当", "チンして食べてね", "一匹狼",
                "キックボクシング", "昆虫図鑑", "現地調達", "季節のデザート", "フリーマーケット", "深海の神秘", "シャープペンシル", "貧乏暇なし", "棚からぼた餅", "暑中見舞い",
                "あふれ出る知性", "コインランドリー", "バースデーケーキ", "メリークリスマス", "光ファイバー", "シロナガスクジラ", "シュノーケリング", "スカイダイビング", "検索エンジン", "シミュレーション",
                "ホームポジション", "優柔不断", "人体のしくみ", "コーヒーブレイク", "豪華客船", "通勤快速", "安全第一", "猛犬注意", "イワシの缶詰", "バンジージャンプ",
                "ストップウォッチ", "懐中時計", "誠意を見せます", "ジェット噴射", "ハワイアンブルー", "不在着信", "注射怖い", "エンゲル係数", "人生色々", "論より証拠",
                "あんたに惚れた！", "舌噛んじゃった", "ケーキは別腹", "絶対音感", "禁断の果実", "アリバイ工作", "公園デビュー", "今日の占い", "手も足も出ない", "ホイップクリーム",
                "絶世の美女", "穴あき靴下"
            ]
            question_hiragana = lev4_words_hiragana[random.randint(0, 180)]
            question_kanji = lev4_words_kanji[random.randint(0, 180)]
            self= [question_hiragana, question_kanji]
            return question
        lev0 = [lev0_words_kanji, lev0_words_hiragana]
        lev1 = [lev1_words_kanji, lev1_words_hiragana]
        lev2 = [lev2_words_kanji, lev2_words_hiragana]
        lev3 = [lev3_words_kanji, lev3_words_hiragana]
        lev4 = [lev4_words_kanji, lev4_words_hiragana]
        word_llist = [lev0, lev1, lev2, lev3, lev4,]


############################### メイン
# クラスを出してオブジェクトの作成
typing = tiping(0)

# 何回問題を出したかカウントする変数を用意
count_lev1 = 0
# フラグを立てる
try_answer = True
try_game = True
# 出した問題を格納するリストの初期化
answered = []
# 成績系のカウンタの初期化
correct_answer = 0
incorrect_answer= 0
try_typinggame = 'yes'


# ゲーム開始
for i in range(20):
    typing.word_lev_








''''
    # 結果発表
    print('終了!!')
    sleep(2)
    print(f'かかった時間：{int(elapsed_time)}秒')
    sleep(2)
    print(f'間違えた数：{incorrect_answer}回')
    sleep(2)
    try_typinggame = ('もう一度遊びますか？yes/no')
    while True:
        if try_typinggame == 'yes':
            break
        elif try_typinggame == 'no':
            try_game =False
            break
        else:
            try_game = input('yesかnoで答えてください>>>')
print('タイピングゲームを終了します')
'''
