######################################################## モジュール使用　#################################################
# 最初の挨拶で使うモジュール
from datetime import datetime
# ラッキーカラーで使うモジュール
import random
# 電卓で使うモジュール
import tkinter as tk
from tkinter import ttk
# 天気予報で使うモジュール
import requests
from datetime import datetime
# タイピングゲームで使うモジュール
from time import sleep
import time
import random

###################################################### 文字の色づけ : 参考　https://www.python.ambitious-engineer.com/archives/3721
end = '\033[0m' # リセット
# 色セット
red = '\033[31m'
green = '\033[32m'
yellow = '\033[33m'
blue = '\033[34m'
magenda = '\033[35m'
cyan = '\033[36m'
# その他
reverse_coler = '\033[7m' # 色反転
bold = '\033[1m' # 太字
underline =  '\033[4m' # アンダーライン

############################################################### 関数 ###############################################################
#------------------------------------------------ ラッキーカラーの関数 ------------------------------------------------#
# 関数
def lucky_collar(fortune_num):
    # 1-14までのランダムな数字で色を決める
    fortune_num = random.randint(1, 14)
    if fortune_num == 1:
        fortune_num = '白'
    elif fortune_num == 3:
        fortune_num = '黒'
    elif fortune_num == 4:
        fortune_num = '赤'
    elif fortune_num == 5:
        fortune_num = '緑'
    elif fortune_num == 6:
        fortune_num = '黄'
    elif fortune_num == 7:
        fortune_num = '青'
    elif fortune_num == 8:
        fortune_num = '紫'
    elif fortune_num == 9:
        fortune_num = '橙'
    elif fortune_num == 10:
        fortune_num = '茶'
    elif fortune_num == 11:
        fortune_num = 'ピンク'
    elif fortune_num == 12:
        fortune_num = '灰'
    elif fortune_num == 13:
        fortune_num = 'オリーブ'
    elif fortune_num == 14:
        fortune_num = '黄緑'
    # 戻り値で色をメインに返す
    return fortune_num

#------------------------------------------------ 電卓の関数 ------------------------------------------------#
# 参照　⇒　https://qiita.com/Atsu1209jp/items/c471177c091cce2f4b4f
def calculator(enter):
    # Define
    BUTTON = [
        ['', 'B', 'C', '/'],
        ['7', '8', '9', '*'],
        ['4', '5', '6', '-'],
        ['1', '2', '3', '+'],
        ['00', '0', '.', '=']
    ]
    
    SYMBOL = ['+', '-', '*', '/']
    
    class CaluGui(object):
        def __init__(self, app=None):
            # Define
            self.calc_str = '' # 計算用の文字列
    
            # Window Setting
            app.title('電卓') # Window のタイトル
            app.geometry('500x700') # Window のサイズ
    
            # Frame Setting
            calc_frame = ttk.Frame(app, width=300, height=100) # 計算式と結果用のFrame
            calc_frame.propagate(False) # サイズが固定される
            calc_frame.pack(side=tk.TOP, padx=10, pady=20) # 余白の設定
            button_frame = ttk.Frame(app, width=300, height=400) # 計算ボタン用のFrame
            button_frame.propagate(False) # サイズが固定される
            button_frame.pack(side=tk.BOTTOM) # 余白の設定
    
            # Parts Setting
            self.calc_var = tk.StringVar() # 計算式用の動的変数
            self.ans_var = tk.StringVar() # 結果用の動的変数
            calc_label = tk.Label(calc_frame, textvariable=self.calc_var, font=("",20)) # 計算式用のLabel
            ans_label = tk.Label(calc_frame, textvariable=self.ans_var, font=("",15)) # 結果用のLabel
            calc_label.pack(anchor=tk.E) # 右揃えで配置
            ans_label.pack(anchor=tk.E) # 右揃えで配置
    
            for y, row in enumerate(BUTTON, 1): # Buttonの配置
                for x, num in enumerate(row):
                    button = tk.Button(button_frame, text=num, font=('', 15), width=6, height=3)
                    button.grid(row=y, column=x) # 列や行を指定して配置
                    button.bind('<Button-1>', self.click_button) # Buttonが押された場合
        
        def click_button(self, event):
            check = event.widget['text'] # 押したボタンのCheck
    
            if check == '=': # イコールの場合
                if self.calc_str[-1:] in SYMBOL: # 記号の場合、記号よりも前で計算
                    self.calc_str = self.calc_str[:-1]
    
                res = '= ' + str(eval(self.calc_str)) # eval関数の利用
                self.ans_var.set(res)
            elif check == 'C': # クリアの場合
                self.calc_str = ''
                self.ans_var.set('')
            elif check == 'B': # バックの場合
                self.calc_str = self.calc_str[:-1]
            elif check in SYMBOL: # 記号の場合
                if self.calc_str[-1:] not in SYMBOL and self.calc_str[-1:] != '':
                    self.calc_str += check
                elif self.calc_str[-1:] in SYMBOL: # 記号の場合、入れ替える
                    self.calc_str = self.calc_str[:-1] + check
            else: # 数字などの場合
                self.calc_str += check
    
            self.calc_var.set(self.calc_str)
        
    
    
    def main():
        # Window Setting
        app = tk.Tk()
        # Window size non resizable
        app.resizable(width=False, height=False)
        CaluGui(app)
        # Display
        app.mainloop() # Window をループで回すことで Widgit に対応できるようになる
    
    if __name__ == '__main__':
        main()
    
    enter = CaluGui

#------------------------------------------------ 天気予報の関数 ------------------------------------------------#
# 参考：https://qiita.com/sesame/items/93acd90803c8f9edfdfb
# 関数
# 入力した地点データ(引数)をもとにhttps://weather.tsukumijima.net/api/forecast?city={city}に
# アクセスして明日の天気予報を取得する
def get_weather(city_name):
    # メインから送られてきた都道府県名を辞書で検索
    try:
        conversion_city_cods = {
        '北海道': '016010',
        '青森県': '020010',
        '岩手県': '030010',
        '宮城県': '040010',
        '秋田県': '050010',
        '山形県': '060010',
        '福島県': '070010',
        '茨城県': '080010',
        '栃木県': '090010',
        '群馬県': '100010',
        '埼玉県': '110010',
        '千葉県': '120010',
        '東京都': '130010',
        '神奈川県': '140010',
        '新潟県': '150010',
        '富山県': '160010',
        '石川県': '170010',
        '福井県': '180010',
        '山梨県': '190010',
        '長野県': '200010',
        '岐阜県': '210010',
        '静岡県': '220010',
        '愛知県': '230010',
        '三重県': '240010',
        '滋賀県': '250010',
        '京都府': '260010',
        '大阪府': '270000',
        '兵庫県': '280010',
        '奈良県': '290010',
        '和歌山県': '300010',
        '鳥取県': '310010',
        '島根県': '320010',
        '岡山県': '330010',
        '広島県': '340010',
        '山口県': '350010',
        '徳島県': '360010',
        '香川県': '370000',
        '愛媛県': '380010',
        '高知県': '390010',
        '福岡県': '400010',
        '佐賀県': '410010',
        '長崎県': '420010',
        '熊本県': '430010',
        '大分県': '440010',
        '宮崎県': '450010',
        '鹿児島県': '460010',
        '沖縄県': '471010'
        }
        city = conversion_city_cods[city_name]
        url = f"https://weather.tsukumijima.net/api/forecast?city={city}"
        response  = requests.get(url)
        response.raise_for_status()

        data_json = response.json()
    
        date_str = data_json["forecasts"][1]["date"]
        date = datetime.strptime(date_str,"%Y-%m-%d").strftime("%Y年%m月%d日")
        title = data_json["title"]
        weather = data_json["forecasts"][1]["telop"]
        max_temp = data_json["forecasts"][1]["temperature"]["max"]["celsius"]
        min_temp = data_json["forecasts"][1]["temperature"]["min"]["celsius"]
        
        results = f"{date}の{city_name}の天気は{weather}です。\n最高気温は{max_temp}度、最低気温は{min_temp}度です。"
        return results
    
    except requests.exceptions.RequestException as e:
        return f"正しい都道府県名を入力してください: {e}"
        
    except KeyError as e:
        return f"予期しないデータ形式です: {e}"

############################################################ タイピングゲームの問題############################################################################
##### 文字の色づけ : 参考　https://www.python.ambitious-engineer.com/archives/3721
end = '\033[0m' # リセット
# 色セット
red = '\033[31m'
green = '\033[32m'
yellow = '\033[33m'
blue = '\033[34m'
magenda = '\033[35m'
cyan = '\033[36m'
# その他
reverse_coler = '\033[7m' # 色反転
bold = '\033[1m' # 太字
underline =  '\033[4m' # アンダーライン


# レベル0の単語
lev0_words_hiragana = [
    "もも", "ぱぱ", "くま", "あい", "あか", "あじ", "あな", "あゆ", "いか", "いし",
    "いぬ", "うし", "うそ", "うに", "うめ", "えい", "さば", "えび", "えみ", "かに",
    "わに", "ごむ", "さる", "すし", "たこ", "たま", "ちげ", "ぽち", "みけ", "ぶり",
    "ぴざ", "なつ", "はる", "あき", "ふゆ", "じか", "ねこ", "いど", "つき", "たけ",
    "すな", "うみ", "かい", "ねぎ", "ちか", "かぜ", "しろ", "かべ", "ぞう", "のり",
    "いす", "さら", "はな", "うま", "ぱん", "こめ", "がむ", "どあ", "いと", "ゆき"
    ]
lev0_words_kanji = [
    "もも", "パパ", "熊", "愛", "赤", "アジ", "穴", "鮎", "イカ", "石",
    "犬", "牛", "嘘", "ウニ", "梅", "エイ", "サバ", "海老", "笑み", "カニ",
    "ワニ", "ゴム", "サル", "寿司", "タコ", "タマ", "チゲ", "ポチ", "ミケ", "ブリ",
    "ピザ", "夏", "春", "秋", "冬", "時価", "猫", "井戸", "月", "竹",
    "砂", "海", "貝", "ネギ", "地下", "風", "城", "壁", "象", "ノリ",
    "イス", "皿", "花", "馬", "パン", "米", "ガム", "ドア", "糸", "雪"
    ]


# レベル１の単語
lev1_words_hiragana = [
    "やけい", "らいち", "しげん", "もでる", "こいん", "あふろ", "かんじ", "ばなな", "ばっと", "あなご",
    "うなぎ", "わーい", "すいか", "いちご", "くろず", "つつじ", "ぞんび", "ごうう", "かーぶ", "あかみ",
    "あわび", "いくら", "いわし", "おちゃ", "かえる", "かれい", "あれ？", "けがに", "さっき", "さんま",
    "はまち", "しろみ", "かっぱ", "にゃー", "ばった", "ひらめ", "ほたて", "まうす", "まぐろ", "するめ",
    "さんそ", "ぷりん", "わさび", "かっぱ", "まっち", "あー！", "わー！", "とんぼ", "でんわ", "すずめ",
    "れたす", "ばけつ", "ぼーる", "めがね", "ことり", "ひっし", "なまず", "あさり", "しじみ", "むしば",
    "しっぽ", "ばっと", "ぼきん", "うさぎ", "あひる", "ひつじ", "つくえ", "あいす", "はなび", "おやつ",
    "みるく", "こっぷ", "おふろ", "さくら", "わごむ", "めいし", "のーと", "くるま", "きっく", "すきー",
    "しまい", "りぼん", "ずぼん", "ぶーつ", "りんご", "こあら", "れんず", "だいや", "するめ", "かれー",
    "めろん", "めだか", "ねごと"
]

lev1_words_kanji = [
    "夜景", "ライチ", "資源", "モデル", "コイン", "アフロ", "漢字", "バナナ", "バット", "アナゴ",
    "ウナギ", "わーい", "スイカ", "イチゴ", "黒酢", "つつじ", "ゾンビ", "豪雨", "カーブ", "赤身",
    "アワビ", "イクラ", "イワシ", "お茶", "カエル", "カレイ", "あれ？", "毛ガニ", "殺気", "サンマ",
    "ハマチ", "白身", "カッパ", "ニャー", "バッタ", "ヒラメ", "ホタテ", "マウス", "マグロ", "スルメ",
    "酸素", "プリン", "ワサビ", "カッパ", "マッチ", "あー！", "わー！", "トンボ", "電話", "スズメ",
    "レタス", "バケツ", "ボール", "眼鏡", "小鳥", "必死", "ナマズ", "アサリ", "シジミ", "虫歯",
    "尻尾", "バット", "募金", "ウサギ", "アヒル", "ヒツジ", "机", "アイス", "花火", "おやつ",
    "ミルク", "コップ", "お風呂", "桜", "輪ゴム", "名刺", "ノート", "車", "キック", "スキー",
    "姉妹", "リボン", "ズボン", "ブーツ", "りんご", "コアラ", "レンズ", "ダイヤ", "するめ", "カレー",
    "メロン", "メダカ", "寝言"
]

# レベル2の単語
lev2_words_hiragana = [
    "ふいうち", "くまげら", "むささび", "すぺいん", "ちちのひ", "さざなみ", "しょどう", "たちよみ", "びしょう", "おかりな",
    "ふじさん", "しきしゃ", "ぱぱいや", "どりあん", "こーひー", "ししゃも", "たこやき", "とびっこ", "やきゅう", "おむれつ",
    "ぐろーぶ", "にんじゃ", "きばせん", "わたがし", "らーめん", "よーよー", "かおもじ", "こしあん", "つぶあん", "たいふう",
    "そぷらの", "いのしし", "ふぃるむ", "ぶらんど", "あぼかど", "おれんじ", "めんせき", "たんぽぽ", "うめしゅ", "たぴおか",
    "かんふー", "てぬぐい", "あいこん", "しまうま", "らいおん", "ろうそく", "くつした", "きんぱつ", "けんだま", "かにたま",
    "ぼくとう", "せんしゃ", "あかがい", "あまえび", "うぐいす", "いやーん", "えんがわ", "おおとろ", "かずのこ", "さーもん",
    "すーぱー", "すらいむ", "でこぴん", "あざらし", "ねぎとろ", "はんせい", "きんぎょ", "ざりがに", "みじんこ", "しんばし",
    "はちみつ", "かんぱち", "しょうゆ", "すきやき", "すずむし", "きゃー！", "なまはむ", "ちゃいむ", "さーかす", "きゃべつ",
    "そうじき", "あおぞら", "おにぎり", "ふうりん", "ぼーなす", "ちきゅう", "きゃんぷ", "はくしゅ", "だいこん", "しんかい",
    "がっこう", "ふぁいる", "くりっく", "ちょきん", "にわとり", "ごーる！", "おまつり", "しゃべる", "すこっぷ", "はつゆめ",
    "くっきー", "こーひー", "こうちゃ", "せんとう", "おはなみ", "けしごむ", "べてらん", "かまくら", "たいまー", "ばんぱー",
    "ながぐつ", "さっかー", "すけーと", "ばってら", "ぎちょう", "ねくたい", "かぼちゃ", "こくばん", "わるぢえ", "かんけり"
]

lev2_words_kanji = [
    "不意打ち", "クマゲラ", "ムササビ", "スペイン", "父の日", "さざなみ", "書道", "立ち読み", "微笑", "オカリナ",
    "富士山", "指揮者", "パパイヤ", "ドリアン", "コーヒー", "ししゃも", "たこ焼き", "トビッコ", "野球", "オムレツ",
    "グローブ", "忍者", "騎馬戦", "綿菓子", "ラーメン", "ヨーヨー", "顔文字", "こしあん", "つぶあん", "台風",
    "ソプラノ", "イノシシ", "フィルム", "ブランド", "アボカド", "オレンジ", "面積", "たんぽぽ", "梅酒", "タピオカ",
    "カンフー", "てぬぐい", "アイコン", "シマウマ", "ライオン", "ろうそく", "靴下", "金髪", "けんだま", "かに玉",
    "木刀", "洗車", "赤貝", "甘エビ", "ウグイス", "イヤーン", "えんがわ", "大トロ", "数の子", "サーモン",
    "スーパー", "スライム", "でこピン", "アザラシ", "ネギとろ", "反省", "金魚", "ザリガニ", "ミジンコ", "新橋",
    "蜂蜜", "カンパチ", "醤油", "スキヤキ", "鈴虫", "キャー！", "生ハム", "チャイム", "サーカス", "キャベツ",
    "掃除機", "青空", "おにぎり", "風鈴", "ボーナス", "地球", "キャンプ", "拍手", "大根", "深海",
    "学校", "ファイル", "クリック", "貯金", "ニワトリ", "ゴール！", "お祭り", "シャベル", "スコップ", "初夢",
    "クッキー", "コーヒー", "紅茶", "銭湯", "お花見", "消しゴム", "べテラン", "かまくら", "タイマー", "バンパー",
    "長靴", "サッカー", "スケート", "バッテラ", "議長", "ネクタイ", "かぼちゃ", "黒板", "悪知恵", "缶蹴り"
]

# レベル３
lev3_words_hiragana = [
    "ひめりんご", "たまのこし", "おんらいん", "にほんちず", "ちんじゅう", "もらいなき", "ほうせんか", "すいさいが", "かせいじん", "りこーだー",
    "ばいおりん", "はーもにか", "すとらっぷ", "そりてぃあ", "もんぶらん", "かつかれー", "こどものひ", "らっきー！", "めんちかつ", "おむらいす",
    "えいたんご", "あくせんと", "いいゆだな", "さくらんぼ", "にわかあめ", "らんきんぐ", "ちゃーはん", "くりすます", "ちょうちょ", "まよねーず",
    "はなふぶき", "しくらめん", "うでどけい", "だいどころ", "りこーだー", "りんごあめ", "かれんだー", "ほいっする", "さふぁいあ", "かみねんど",
    "だいとかい", "でりけーと", "すなどけい", "すとらいぷ", "ふぃるたー", "おままごと", "はりけーん", "ゆきだるま", "すにーかー", "とらくたー",
    "いやしけい", "おきにいり", "ちへいせん", "くれーたー", "ぎゃらりー", "らんどせる", "ひかえしつ", "てでぃべあ", "ゆめごこち", "しんちょう",
    "たいじゅう", "あんけーと", "くりすたる", "かんがるー", "しゅりけん", "ひざこぞう", "すとれーと", "ろんぐぱす", "ひょうがき", "えどばくふ",
    "ふるほんや", "らふれしあ", "ひなあられ", "あめふらし", "あめちゃん", "あらいやだ", "いいてんき", "いたいです", "えびふらい", "おおもりで",
    "かうんたー", "ぎんしゃり", "しゃったー", "しんぶんし", "ずわいがに", "たらばがに", "ちゅうとろ", "あめとむち", "たまごやき", "めだまやき",
    "ぶるどっぐ", "ぼたんえび", "ほんきのめ", "もやしっこ", "よっぱらい", "わたぼこり", "ちらしずし", "てまきずし", "りさいくる", "てっかまき",
    "おふさいど", "とくもりで", "するめいか", "こどものひ", "えころじー", "えちけっと", "てぃらみす", "でざいなー", "はねぼうき", "かれんだー",
    "きーぼーど", "さくらさく", "かたたたき", "ねったいや", "かっぱまき", "おやこどん", "びりやーど", "ぼうりんぐ", "じせだいき", "たいぴんぐ",
    "まんほーる", "ゆうえんち", "どらいやー", "わいしゃつ", "おおそうじ", "おーとばい", "こうきあつ", "じゃんぐる", "しゃんぱん", "えいがかん",
    "こんさーと", "ごぜんさま", "もしもし？", "むじんとう", "ごーじゃす", "こんにちは", "さようなら", "だいにんき", "はつひので", "すぴーかー",
    "てぃっしゅ", "えどじだい", "ちょんまげ", "こいのぼり", "そーせーじ", "きょうだい", "ゆきだるま", "たっきゅう", "かたるしす", "さくらもち",
    "よーぐると", "しょうかき", "ぷろのわざ", "ぶゆうでん", "あるまじろ", "てれびっこ", "はろうぃん", "ぱんぷきん", "じがじさん", "ぺあるっく"
]

lev3_words_kanji = [
    "姫りんご", "玉の輿", "オンライン", "日本地図", "珍獣", "もらい泣き", "ホウセンカ", "水彩画", "火星人", "リコーダー",
    "バイオリン", "ハーモニカ", "ストラップ", "ソリティア", "モンブラン", "カツカレー", "こどもの日", "ラッキー！", "メンチカツ", "オムライス",
    "英単語", "アクセント", "いい湯だな", "さくらんぼ", "にわか雨", "ランキング", "チャーハン", "クリスマス", "ちょうちょ", "マヨネーズ",
    "花吹雪", "シクラメン", "腕時計", "台所", "リコーダー", "りんご飴", "カレンダー", "ホイッスル", "サファイア", "紙粘土",
    "大都会", "デリケート", "砂時計", "ストライプ", "フィルター", "おままごと", "ハリケーン", "雪だるま", "スニーカー", "トラクター",
    "癒し系", "お気に入り", "地平線", "クレーター", "ギャラリー", "ランドセル", "控え室", "テディベア", "夢心地", "身長",
    "体重", "アンケート", "クリスタル", "カンガルー", "手裏剣", "ひざ小僧", "ストレート", "ロングパス", "氷河期", "江戸幕府",
    "古本屋", "ラフレシア", "ひなあられ", "アメフラシ", "飴ちゃん", "アラ嫌だ", "いい天気", "痛いです", "エビフライ", "大盛りで",
    "カウンター", "銀シャリ", "シャッター", "新聞紙", "ズワイガニ", "タラバガニ", "中トロ", "アメとムチ", "玉子焼き", "目玉焼き",
    "ブルドッグ", "ボタン海老", "本気の目", "モヤシっ子", "酔っ払い", "綿ボコリ", "ちらしズシ", "手巻きズシ", "リサイクル", "鉄火巻き",
    "オフサイド", "特盛りで", "スルメイカ", "こどもの日", "エコロジー", "エチケット", "ティラミス", "デザイナー", "羽根ボウキ", "カレンダー",
    "キーボード", "サクラサク", "肩叩き", "熱帯夜", "カッパ巻き", "親子丼", "ビリヤード", "ボウリング", "次世代機", "タイピング",
    "マンホール", "遊園地", "ドライヤー", "ワイシャツ", "大掃除", "オートバイ", "高気圧", "ジャングル", "シャンパン", "映画館",
    "コンサート", "午前様", "もしもし？", "無人島", "ゴージャス", "こんにちは", "さようなら", "大人気", "初日の出", "スピーカー",
    "ティッシュ", "江戸時代", "ちょんまげ", "鯉のぼり", "ソーセージ", "兄弟", "雪だるま", "卓球", "カタルシス", "さくらもち",
    "ヨーグルト", "消火器", "プロの技", "武勇伝", "アルマジロ", "テレビっ子", "ハロウィン", "パンプキン", "自画自賛", "ペアルック"
]

# レベル４
lev4_words_hiragana = [
    "まよえるこひつじ", "さんちちょくそう", "ぜんせききんえん", "きしょうてんけつ", "ごうこんしようよ", "とうようのまじょ", "びじょとやじゅう", "きょうだいげんか", "しんたいそくてい", "ひゃくまんぼると",
    "あせろらかじゅう", "おれじゃないって", "りょうさいけんぼ", "にんじんはきらい", "ちゃぶだいがえし", "わーぷろけんてい", "いちげきひっさつ", "てんごくとじごく", "ぼでぃらんげーじ", "どらごんふるーつ",
    "しんれいすぽっと", "わすれものない？", "かるしうむぶそく", "うーぱーるーぱー", "ことりのさえずり", "ぼっしゅうします", "げんきいっぱい！", "おはだにやさしい", "いけばながしゅみ", "しんぴんのつくえ",
    "でみぐらすそーす", "どうぶつのふしぎ", "あたたかいひざし", "でんげきけっこん", "おもしろはんぶん", "いがいないちめん", "わかてのるーきー", "けんとうをいのる", "ひっこしびんぼう", "がんばれにっぽん",
    "ぴんぽんだっしゅ", "ゆびきりげんまん", "ししゃものたまご", "からしめんたいこ", "はっしゅどびーふ", "ぶらっくこーひー", "せいけんこうたい", "ここだけのはなし", "きんしゅきんえん", "いまがちゃんす！",
    "ぜんげんてっかい", "わたしはめがねは", "おりかえしちてん", "ぼうさいくんれん", "ほしのおうじさま", "ふんだりけったり", "ときすでにおそし", "あるひのできごと", "ちゃーしゅーめん", "しゃちょうひしょ",
    "にゅーすそくほう", "ぼんごれびあんこ", "えいぷりるふーる", "やきとうもろこし", "かくやすぶっけん", "てれびのりもこん", "あいさいべんとう", "ぶらっくぺっぱー", "さくらまうきせつ", "だいれくとめーる",
    "くうきがおいしい", "さんかくじょうぎ", "きしょうよほうし", "いっせきにちょう", "こーんぽたーじゅ", "もぎたてふるーつ", "かいぎしつのかぎ", "とうきょうちさい", "ねっけつきょうし", "ぐれーぷふるーつ",
    "さくらのはなびら", "ちゅうかんてすと", "とうめいにんげん", "あんごうかいどく", "にほんだいひょう", "しふくのひととき", "りくるーとすーつ", "こうかせいしょう", "しょうきんかせぎ", "いいおあじですね",
    "じゅくれんのわざ", "ちゅうしゃじょう", "しゃしんさつえい", "だちょうのたまご", "ぜんこくたいかい", "さんきんこうたい", "ひっとえんどらん", "げんだいしゃかい", "きしょうえいせい", "べーすらんにんぐ",
    "やきゅうひとすじ", "てんたいかんそく", "せいようたんぽぽ", "ひっしょうきがん", "うちゅうせいふく", "うちゅうゆうえい", "せいとかいちょう", "いたくしないでね", "いちえんひろった", "うそでもいいから",
    "えびでたいをつる", "おおさじいっぱい", "おさきにしつれい", "ことぶきたいしゃ", "このきなんのき？", "しんれいしゃしん", "すなっぷきかせて", "ちょっとまった！", "つぎはにほんしゅ", "でぱーとでまいご",
    "でんきゅうきれた", "ねぼうでけびょう", "ばすがすばくはつ", "ぴらみっどぱわー", "ぷりんあらもーど", "もってけどろぼー", "もよりえきはちば", "らくらいちゅうい", "たましいのさけび", "いちえんたりない",
    "たっちたいぴんぐ", "みすてりーつあー", "けいりょうかっぷ", "おしょうゆとって", "こうぎょうちたい", "しんこんりょこう", "ねっとさーふぃん", "こんびにべんとう", "ちんしてたべてね", "いっぴきおおかみ",
    "きっくぼくしんぐ", "こんちゅうずかん", "げんちちょうたつ", "きせつのでざーと", "ふりーまーけっと", "しんかいのしんぴ", "しゃーぷぺんしる", "びんぼうひまなし", "たなからぼたもち", "しょちゅうみまい",
    "あふれでるちせい", "こいんらんどりー", "ばーすでーけーき", "めりーくりすます", "ひかりふぁいばー", "しろながすくじら", "しゅのーけりんぐ", "すかいだいびんぐ", "けんさくえんじん", "しみゅれーしょん",
    "ほーむぽじしょん", "ゆうじゅうふだん", "じんたいのしくみ", "こーひーぶれいく", "ごうかきゃくせん", "つうきんかいそく", "あんぜんだいいち", "もうけんちゅうい", "いわしのかんづめ", "ばんじーじゃんぷ",
    "すとっぷうぉっち", "かいちゅうどけい", "せいいをみせます", "じぇっとふんしゃ", "はわいあんぶるー", "ふざいちゃくしん", "ちゅうしゃこわい", "えんげるけいすう", "じんせいいろいろ", "ろんよりしょうこ",
    "あんたにほれた！", "したかんじゃった", "けーきはべつばら", "ぜったいおんかん", "きんだんのかじつ", "ありばいこうさく", "こうえんでびゅー", "きょうのうらない", "てもあしもでない", "ほいっぷくりーむ",
    "ぜっせいのびじょ", "あなあきくつした"
]

lev4_words_kanji = [
    "迷える子羊", "産地直送", "全席禁煙", "起承転結", "合コンしようよ", "東洋の魔女", "美女と野獣", "兄弟げんか", "身体測定", "百万ボルト",
    "アセロラ果汁", "俺じゃないって", "良妻賢母", "ニンジンは嫌い", "ちゃぶ台返し", "ワープロ検定", "一撃必殺", "天国と地獄", "ボディランゲージ", "ドラゴンフルーツ",
    "心霊スポット", "忘れ物ない？", "カルシウム不足", "ウーパールーパー", "小鳥のさえずり", "没収します", "元気いっぱい！", "お肌に優しい", "生け花が趣味", "新品の机",
    "デミグラスソース", "動物の不思議", "あたたかい日差し", "電撃結婚", "面白半分", "意外な一面", "若手のルーキー", "健闘を祈る", "引越し貧乏", "頑張れニッポン",
    "ピンポンダッシュ", "ゆびきりげんまん", "ししゃもの卵", "からし明太子", "ハッシュドビーフ", "ブラックコーヒー", "政権交代", "ここだけの話", "禁酒禁煙", "今がチャンス！",
    "前言撤回", "私はメガネ派", "折り返し地点", "防災訓練", "星の王子様", "踏んだり蹴ったり", "時すでに遅し", "ある日の出来事", "チャーシューメン", "社長秘書",
    "ニュース速報", "ボンゴレビアンコ", "エイプリルフール", "焼きとうもろこし", "格安物件", "テレビのリモコン", "愛妻弁当", "ブラックペッパー", "桜舞う季節", "ダイレクトメール",
    "空気がおいしい", "三角定規", "気象予報士", "一石二鳥", "コーンポタージュ", "もぎたてフルーツ", "会議室の鍵", "東京地裁", "熱血教師", "グレープフルーツ",
    "桜の花びら", "中間テスト", "透明人間", "暗号解読", "日本代表", "至福のひととき", "リクルートスーツ", "校歌斉唱", "賞金稼ぎ", "いいお味ですね",
    "熟練の技", "駐車場", "写真撮影", "ダチョウの卵", "全国大会", "参勤交代", "ヒットエンドラン", "現代社会", "気象衛星", "ベースランニング",
    "野球一筋", "天体観測", "西洋タンポポ", "必勝祈願", "宇宙征服", "宇宙遊泳", "生徒会長", "痛くしないでね", "一円拾った", "嘘でもいいから",
    "エビでタイを釣る", "大さじ一杯", "お先に失礼", "寿退社", "この木何の木？", "心霊写真", "スナップ効かせて", "ちょっと待った！", "次は日本酒", "デパートで迷子",
    "電球切れた", "寝坊で仮病", "バスガス爆発", "ピラミッドパワー", "プリンアラモード", "持ってけドロボー", "最寄駅は千葉", "落雷注意", "魂の叫び", "一円足りない",
    "タッチタイピング", "ミステリーツアー", "計量カップ", "お醤油とって", "工業地帯", "新婚旅行", "ネットサーフィン", "コンビニ弁当", "チンして食べてね", "一匹狼",
    "キックボクシング", "昆虫図鑑", "現地調達", "季節のデザート", "フリーマーケット", "深海の神秘", "シャープペンシル", "貧乏暇なし", "棚からぼた餅", "暑中見舞い",
    "あふれ出る知性", "コインランドリー", "バースデーケーキ", "メリークリスマス", "光ファイバー", "シロナガスクジラ", "シュノーケリング", "スカイダイビング", "検索エンジン", "シミュレーション",
    "ホームポジション", "優柔不断", "人体のしくみ", "コーヒーブレイク", "豪華客船", "通勤快速", "安全第一", "猛犬注意", "イワシの缶詰", "バンジージャンプ",
    "ストップウォッチ", "懐中時計", "誠意を見せます", "ジェット噴射", "ハワイアンブルー", "不在着信", "注射怖い", "エンゲル係数", "人生色々", "論より証拠",
    "あんたに惚れた！", "舌噛んじゃった", "ケーキは別腹", "絶対音感", "禁断の果実", "アリバイ工作", "公園デビュー", "今日の占い", "手も足も出ない", "ホイップクリーム",
    "絶世の美女", "穴あき靴下"
]

lev0 = [lev0_words_kanji, lev0_words_hiragana]
lev1 = [lev1_words_kanji, lev1_words_hiragana]
lev2 = [lev2_words_kanji, lev2_words_hiragana]
lev3 = [lev3_words_kanji, lev3_words_hiragana]
lev4 = [lev4_words_kanji, lev4_words_hiragana]
word_llist = [lev0, lev1, lev2, lev3, lev4,]

############################################################# メインプログラム ################################################################################

# 名前を入力
nickname = input('あなたのお名前を教えてね>>>')
# botが挨拶 ⇒ 機能を説明 ⇒ 何の機能を使いたいか聞く
time.sleep(1)
print(f'こんにちは！{nickname}さん！\n今日はよろしくね！')
time.sleep(1)
print('さまざまな機能があるから遊んで行ってね！')
('電卓を使いたい場合は"１"')
('明日のラッキーカラーを知りたい場合は"２"')
('明日の全国各地の天気予報を知りたい場合は"３"')
('タイピングゲームで遊びたい場合は"４"')
time.sleep(0.5)
('を入力してね')
try_function_flg = True
while try_function_flg == True:
    while True:
        try:
            select_function = int(input('機能の番号を入力>>>'))
            break
        # 適切な数字が入力されなかったら、入力しなおす
        except ValueError:
            print(f'{red}適切な数字を入力してください{end}')
    # 【制作完了】 1番(電卓)が選ばれた場合******************************************************************** 電卓 ********************************************************************
    if select_function == 1:
        # 適当なキーを打って電卓を起動
        startup_calculator =  calculator(input('電卓を使用します\n適当なキーを押して起動してください'))
        while True:
            # 電卓のウィンドウを閉じたらもう一度使うか聞く
            try_startup = input('もう一度使用しますか？yes/no>>>')
            if try_startup == 'no':
                # noだった場合電卓を終了する
                print('電卓を終了します')
                break
            elif try_startup == 'yes':
                # yesだった場合自動的に電卓を立ち上げる
                startup_calculator =  calculator(startup_calculator)
            else:
                # yesかno以外のものが入力されたらもう一度入力しなおす
                try_startup= input('yesかnoで答えてください>>>')
        # まだほかの機能を使うか聞く
        try_function = input('まだほかの機能を使いますか？yes/no>>>')
        try_function_flg_flg = True
        if try_function == 'yes':
            None
        elif try_function == 'no':
            try_function_flg = False
        else:
            while try_function_flg_flg == True:
                try_game = input('yesかnoで答えてください>>>')
                if try_function == 'yes':
                    try_function_flg_flg = False
                elif try_function == 'no':
                    try_function_flg_flg = False
                    try_function_flg = False
    # 2番(明日のラッキーカラー)が選ばれた場合******************************************************************** ラッキーカラー ********************************************************************
    elif select_function == 2:
        # try_fortuneを最初からyesに設定することで繰り返し処理をうまく実行させれるようにする
        try_fortune = 'yes'
        # 何度でも繰り返せれるように繰り返し処理させる
        while True:
            if try_fortune == str('yes'):
                # ラッキーカラーを占う(2回目以降もyesだった場合表示する)
                print('今日のラッキーカラーを占います')
                color = lucky_collar(input('適当なキーを入力して占う>>>'))
                print(f'今日のラッキーカラーは{color}色です')
                # もう一度占うか聞く
                try_fortune = str(input('もう一度占いますか？yes/no>>>'))
                # noだった場合繰り返し処理を終了させる
            elif try_fortune == str('no'):
                break
            else:
                try_fortune = str(input('yesかnoで答えてください'))
        print('占いを終了します')
        # まだほかの機能を使うか聞く
        try_function = input('まだほかの機能を使いますか？yes/no>>>')
        try_function_flg_flg = True
        if try_function == 'yes':
            None
        elif try_function == 'no':
            try_function_flg = False
        else:
            while try_function_flg_flg == True:
                try_game = input('yesかnoで答えてください>>>')
                if try_function == 'yes':
                    try_function_flg_flg = False
                elif try_function == 'no':
                    try_function_flg_flg = False
                    try_function_flg = False
    # 4番(明日の全国各地の天気予報)が選ばれた場合******************************************************************** 天気予報 ********************************************************************
    elif select_function == 3:
        print('天気予報を起動します')
        try_serch = 'yes'
        while True:
            if try_serch == str('yes'):
                city_number = input("正式な都道府県名を入力してください")
                # 検索結果を表示
                result = get_weather(city_number)
                print(result)
                
                # もう一度使うか聞く
                try_serch = input('まだほかのの天気予報を検索しいですか？yes/no')
                # noだった場合繰り返し処理を終了させる
            elif try_serch == str('no'):
                break
            else:
                try_serch = str(input('yesかnoで答えてください'))
        print('天気予報を終了します')
        # まだほかの機能を使うか聞く
        try_function = input('まだほかの機能を使いますか？yes/no>>>')
        try_function_flg_flg = True
        if try_function == 'yes':
            None
        elif try_function == 'no':
            try_function_flg = False
        else:
            while try_function_flg_flg == True:
                try_game = input('yesかnoで答えてください>>>')
                if try_function == 'yes':
                    try_function_flg_flg = False
                elif try_function == 'no':
                    try_function_flg_flg = False
                    try_function_flg = False
# 5番(タイピングゲームが選ばれた場合)###############################################################################################
    elif select_function == 4:
        # 何回問題を出したかカウントする変数を用意
        count_lev1 = 0
        # フラグを立てる
        try_answer = True
        try_game = True
        # 出した問題を格納するリストの初期化
        answered = []
        # 成績系のカウンタの初期化
        correct_answer = 0
        incorrect_answer= 0
        try_typinggame = 'yes'
        while try_game == True:
            print('タイピングゲームを始めます')
            time.sleep(2)
            print(f'問題に対して回答は*{red}ひらがな{end}*で回答してください')
            print('合計で20問出ます')
            time.sleep(2)
            # レベルを聞く
            while True:
                try: 
                    setting_level = int(input('レベルを選択してください(０～４まで)'))
                    break
                except ValueError:
                    print('整数を入力してください')
            while True:
                if setting_level < 5:
                    break
                else:
                    while True:
                        try: 
                            setting_level = int(input('適切なレベルを選択してください>>>'))
                            break
                        except ValueError:
                            print('整数を入力してください')
            sleep(2)
            print(f'レベル{setting_level}が選択されました')
            sleep(2)
            input('準備ができたら適当なキーを入力して始めてください\n>>>')
            sleep(1)
            print('では始めます')

            # カウントダウン　参考：https://qiita.com/san_bay3/items/067a88e07385eacf23cb
            target_time = 5

            def down_timer(secs):
                for i in range(secs,-1, -1):
                    print(i)
                    sleep(1)
                print("スタート！")

            down_timer(target_time)
            sleep(0.1)
            # はじめた時間の記録
            start_time = time.time()
            # 23回繰り返し入力したらプログラム終了
            for i in range(20):
                # 周回したらフラグを下げる
                try_answer = True
                try:
                    # random_lst_numを使ってランダムに(重複なしで)単語を出力する 参考：https://qiita.com/keitean/items/bcaae967ead115d00467
                    random_lst_num = random.randint(0,60 - i)
                    random_lst_num = int(random_lst_num)
                    # 問題を出力
                    print( word_llist[setting_level][0][random_lst_num],)
                    # 同じ問題が出ないようにする処理
                    word_kanji = word_llist[setting_level][0].pop(random_lst_num)
                except IndexError:
                    # random_lst_numを使ってランダムに(重複なしで)単語を出力する 参考：https://qiita.com/keitean/items/bcaae967ead115d00467
                    random_lst_num = random.randint(0,60 - i)
                    random_lst_num = int(random_lst_num)
                    # 問題を出力
                    print(word_llist[setting_level][0][random_lst_num])
                    # 同じ問題が出ないようにする処理
                    word_kanji = word_llist[setting_level][0].pop(random_lst_num)
                # 答えを代入
                answer_lev1 = word_llist[setting_level][1][random_lst_num]#input('>>>' + yellow + end)
                # try_answerの繰り返し処理
                while try_answer == True :
                    # 出した問題に対してあってるかの条件分岐
                    if word_llist[setting_level][1][random_lst_num] == answer_lev1:
                        print('正解')
                        # 正解したらカウントして次の問題を出力
                        try_answer = False
                        word_hiragana = word_llist[setting_level][1].pop(random_lst_num)
                    else:
                        # 違ったら正解するまで入力させる
                        answer_lev1 = input(f'{red}違います{end}>>>')
                        incorrect_answer += 1
            # 経過時間の記録
            elapsed_time = time.time()-start_time
            # 結果発表
            print('終了!!')
            sleep(2)
            print(f'かかった時間：{int(elapsed_time)}秒')
            sleep(2)
            print(f'間違えた数：{incorrect_answer}回')
            sleep(2)

            # ファイルに記録をする
            with open('issue_typing.txt', 'a', encoding='utf-8') as file:
                file.write(f'\n----------------------------------------------\nユーザー名：{nickname}\nかかった時間：{int(elapsed_time)}秒\n間違えた回数：{incorrect_answer}回')
                file.close
            # 過去の成績を出力するか聞く
            question_past = input('過去の成績データを見ますか？yes/no>>>')
            try_past_flg = True
            try_past_flg_flg = True
            if question_past == 'yes':
                # ファイルを読み込んで成績を出力
                filename = "issue_typing.txt"
                with open(filename, "r",encoding='utf-8') as f:
                    content = f.read()
                    print(content)
            elif question_past == 'no':
                try_game = False
            else:
                while try_past_flg_flg == True:
                    try_game = input('yesかnoで答えてください>>>')
                    if try_game == 'yes':
                        try_past_flg_flg = False
                    elif try_game == 'no':
                        try_past_flg_flg = False
                        try_game = False
            # もう一度遊ぶか聞く
            try_typinggame = input('もう一度遊びますか？yes/no>>>')
            try_game_flg = True
            if try_typinggame == 'yes':
                None
                
            elif try_typinggame == 'no':
                try_game = False
            else:
                while try_game_flg == True:
                    try_game = input('yesかnoで答えてください>>>')
                    if try_typinggame == 'yes':
                        try_game = False
                    elif try_typinggame == 'no':
                        try_game = False
            # まだほかの機能を使うか聞く
        try_function = input('まだほかの機能を使いますか？yes/no>>>')
        try_function_flg_flg = True
        if try_function == 'yes':
            None
        elif try_function == 'no':
            try_function_flg = False
        else:
            while try_function_flg_flg == True:
                try_game = input('yesかnoで答えてください>>>')
                if try_function == 'yes':
                    try_function_flg_flg = False
                elif try_function == 'no':
                    try_function_flg_flg = False
                    try_function_flg = False
        print('タイピングゲームを終了します')
print('チャットボットを終了します')

